
# pip install pandas	Устанавливает последнюю версию пакета.
# pip install "pandas==2.1.0"	Устанавливает строго определенную версию (полезно для стабильности старых проектов).
# pip uninstall pandas	Удаляет пакет.
# pip list	Показывает список всех установленных в текущем окружении пакетов.
# python -m pip install --upgrade pip	Обновляет сам установщик пакетов. Иногда решает странные ошибки.
# pip show pandas	Показывает подробную информацию о пакете: версию, зависимости, путь установки.

import pandas as pd

print(pd.DataFrame({'A': [1, 2]}))