# **********************************Для анализа данных и Data Science
# Эти библиотеки помогают обрабатывать, анализировать и визуализировать данные. 
# practicum.yandex.ru
# wiki.merionet.ru
# NumPy — работа с многомерными массивами и выполнение высокоуровневых математических операций над ними. Основа для многих других библиотек. 
# practicum.yandex.ru
# wiki.merionet.ru
# Pandas — анализ и обработка структурированных данных в табличной форме (DataFrame, Series). Позволяет фильтровать, группировать, агрегировать данные, работать с пропущенными значениями. 
# practicum.yandex.ru
# wiki.merionet.ru
# tproger.ru
# SciPy — расширенные алгоритмы для научных и инженерных вычислений (оптимизация, интегрирование, обработка сигналов, статистика). Строится на базе NumPy. 
# practicum.yandex.ru
# wiki.merionet.ru
# Matplotlib — создание статических, анимированных и интерактивных визуализаций (графики, диаграммы, scatter plots). 
# bangbangeducation.ru
# Seaborn — высокоуровневая библиотека на базе Matplotlib для создания статистических графиков с упрощённым синтаксисом (тепловые карты, распределения). 
# wiki.merionet.ru
# Statsmodels — сложный статистический анализ (линейные и нелинейные модели, тесты гипотез, временные ряды). 
# wiki.merionet.ru
# Scikit-learn — «стандарт» для традиционного машинного обучения (регрессия, классификация, кластеризация). 
# wiki.merionet.ru
# TensorFlow — фреймворк для построения и тренировки нейронных сетей, в том числе для глубокого обучения. 
# neerc.ifmo.ru
# wiki.merionet.ru
# PyTorch — гибкая библиотека для глубокого обучения с поддержкой динамических вычислений и работы с GPU. 
# wiki.merionet.ru
# Keras — высокоуровневая оболочка для TensorFlow, которая упрощает создание и обучение моделей. 
# wiki.merionet.ru


# pip install pandas	Устанавливает последнюю версию пакета.
# pip install "pandas==2.1.0"	Устанавливает строго определенную версию (полезно для стабильности старых проектов).
# pip uninstall pandas	Удаляет пакет.
# pip list	Показывает список всех установленных в текущем окружении пакетов.
# python -m pip install --upgrade pip	Обновляет сам установщик пакетов. Иногда решает странные ошибки.
# pip show pandas	Показывает подробную информацию о пакете: версию, зависимости, путь установки.

import pandas as pd

print(pd.DataFrame({"A": [1, 2]}))


def Fun_string():
    pass


